const thainames = {
    male: [
        // ชื่อปกติ
        "สมชาย", "วิชัย", "ธนากร", "กิตติ", "ชัยวัฒน์", "นพพร", "อภิชาติ",
        // ชื่อดี
        "ศุภกร", "เศรษฐา", "อัครเดช", "ธนบดี", "ปัญญา", "ชาญชัย", "ภาคภูมิ",
        // ชื่อแปลก
        "ผดุงเกียรติ", "พันแสง", "เอกอนันต์", "จักรพงษ์", "ทรงกลด", "ณัฐภัทร", "เทวฤทธิ์",
        // ชื่ออลังการขายขำ
        "หำเล็ก", "ชายสามโบสถ์", "เทพบุตรตีนกุด", "น้ำพุร้อน", "สุดหล่อ", "เจ้าพ่อเขาใหญ่", "หนุ่มโคโยตี้", "สายเปย์", "กล้ามใหญ่", "โจ๊กเกอร์ดงดิบ"
      ],
      female: [
        // ชื่อปกติ
        "สมศรี", "สมใจ", "วิภา", "พิมพ์", "รัชนี", "สุนิสา", "เพ็ญศรี",
        // ชื่อดี
        "พิมพ์มาดา", "รุ่งนภา", "กานต์พิชชา", "ปาริชาติ", "อรอนงค์", "กนกวรรณ", "ปิยนุช",
        // ชื่อแปลก
        "จิตรลดา", "มณีรัตน์", "เบญจมาศ", "อาทิตยา", "บุษยมาส", "ธัญญารัตน์", "พรนัชชา",
        // ชื่ออลังการขายขำ
        "แคนดี้มาร์ช", "นางฟ้าขาสั้น", "ไก่ฟ้าหน้าหวาน", "นางพญางูเห่า", "มิสแก้มแดง", "สาวน้อยร้อยชู้", "เจ้าแม่สามย่าน", "คุณนายโรงสี", "เมียฝรั่ง", "มารีน่าหัวใจทอง"
      ],
  };
  
  export default thainames;