const events = [
  {
    id: 1,
    name: "นักเดินทางลึกลับ",
    description: "บุคคลที่สวมผ้าคลุมเสนอโพชั่นฟรีให้คุณ คุณรับหรือไม่?",
    outcome: "ได้รับบัฟหรือดีบัฟสุ่ม"
  },
  {
    id: 2,
    name: "ศาลเจ้าจารึกโบราณ",
    description: "บรรยากาศลึกลับล้อมรอบศาลเจ้าที่โบราณนี้",
    outcome: "ฟื้นฟู HP 20 หรือเพิ่มค่าสถานะสุ่ม +1"
  },
  {
    id: 3,
    name: "หีบสมบัติ",
    description: "หีบเก่าแก่ที่ปกคลุมด้วยฝุ่นวางอยู่มุมห้อง",
    outcome: "พบสมบัติสุ่มหรือกระตุ้นกับดัก!"
  },
];

export default events;
